app/app/Controllers/Auth.php

    public function tentarLogin()
    {
        // 1. Obtém os dados de email e senha do formulário via requisição POST.
        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        // 2. Carrega o Model para interagir com a tabela de usuários.
        $model = new UsuarioModel();

        // 3. Busca o usuário no banco de dados pelo email fornecido.
        $usuario = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'teste@teste.com'
 LIMIT 1