app/app/Controllers/CategoriasController.php

SELECT *
FROM `categorias_financeiras`
---
    public function index()
    {
        $model = new CategoriasFinanceirasModel();

        $data = [
            'titulo' => 'Categorias Financeiras (Plano de Contas DFC)',
            'categorias' => $model->findAll(),
        ];