app/app/Controllers/FinanceiroController.php

    public function index()
    {
        $data = [
            'titulo' => 'Contas Pendentes (Regime de Competência)',
            // Buscamos apenas transações com status PENDENTE
            'transacoes' => $this->transacaoModel->where('status', 'PENDENTE')->findAll(),
        ];
---
SELECT *
FROM `transacoes`
WHERE `status` = 'PENDENTE'

    public function novaTransacao()
    {
        $data = [
            'titulo'     => 'Nova Transação (A Pagar ou A Receber)',
            'pessoas'    => $this->pessoaModel->findAll(),
            'categorias' => $this->categoriaModel->findAll(),
        ];
---
SELECT *
FROM `pessoas`