app/app/Controllers/PessoasController.php

    public function index()
    {
        $model = new PessoaModel();

        // 1. Captura ordenação
        $ordem   = $this->request->getGet('ordem') ?? 'id';
        $direcao = $this->request->getGet('direcao') ?? 'asc';

        // 2. Whitelist de segurança
        $colunasPermitidas = ['id', 'nome', 'cliente', 'email', 'documento'];
        if (!in_array($ordem, $colunasPermitidas)) {
            $ordem = 'id';
        }
        $direcao = (strtolower($direcao) === 'desc') ? 'desc' : 'asc';

        // 3. Busca os dados COM PAGINAÇÃO
        // O método paginate() substitui o findAll() e já considera o limite por página
        $pessoas = $model->orderBy($ordem, $direcao)->paginate(10);
---
SELECT *
FROM `pessoas`