app/app/Controllers/PessoasController.php

    public function index()
    {
        $model = new PessoaModel();

        // 1. Captura ordenação
        $ordem   = $this->request->getGet('ordem') ?? 'id';
        $direcao = $this->request->getGet('direcao') ?? 'asc';

        // 2. Whitelist de segurança
        $colunasPermitidas = ['id', 'nome', 'email', 'documento'];
        if (!in_array($ordem, $colunasPermitidas)) {
            $ordem = 'id';
        }
        $direcao = (strtolower($direcao) === 'desc') ? 'desc' : 'asc';

        // 3. Busca os dados COM PAGINAÇÃO
        // O método paginate() substitui o findAll() e já considera o limite por página
        $pessoas = $model->orderBy($ordem, $direcao)->paginate(10);
---
SELECT *
FROM `pessoas`
ORDER BY `id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pessoas`

    public function editar($id = null)
    {
        $model = new PessoaModel();
        $pessoa = $model->find($id);
---
SELECT *
FROM `pessoas`
WHERE `pessoas`.`id` = '1'