app/app/Models/RelatorioModel.php

SELECT `t`.*, `p`.`nome`, `p`.`tipo_cliente`, `p`.`email`
FROM `transacoes` `t`
JOIN `pessoas` `p` ON `p`.`id` = `t`.`pessoa_id`
WHERE DATE(t.data_caixa) >= '2025-11-01'
AND DATE(t.data_caixa) <= '2025-11-30'
AND `p`.`tipo_cliente` = 'Salutem'
AND `t`.`tipo` = 'PAGAR'
ORDER BY `t`.`data_caixa` DESC
---
    public function getTransacoesPorTipoCliente($dataInicio = null, $dataFim = null, $tipoCliente = null, $tipoTransacao = null)
    {
        $builder = $this->db->table('transacoes t');
        $builder->select('t.*, p.nome, p.tipo_cliente, p.email');
        $builder->join('pessoas p', 'p.id = t.pessoa_id'); // CORREÇÃO: pessoa_id

        // Filtro por datas (usando data_caixa conforme sua estrutura)
        if (!empty($dataInicio)) {
            $builder->where('DATE(t.data_caixa) >=', date('Y-m-d', strtotime($dataInicio)));
        }

        if (!empty($dataFim)) {
            $builder->where('DATE(t.data_caixa) <=', date('Y-m-d', strtotime($dataFim)));
        }

        // Filtro por tipo de cliente
        if (!empty($tipoCliente) && $tipoCliente != 'todos') {
            $builder->where('p.tipo_cliente', $tipoCliente);
        }

        // Filtro por tipo de transação (PAGAR/RECEBER)
        if (!empty($tipoTransacao) && $tipoTransacao != 'todos') {
            $builder->where('t.tipo', $tipoTransacao);
        }

        // Filtro por status (opcional, se quiser apenas concluídas)
        // $builder->where('t.status', 'CONCLUIDA');

        $builder->orderBy('t.data_caixa', 'DESC');

        return $builder->get()->getResultArray();

SELECT SUM(t.valor) as total, `p`.`tipo_cliente`, `t`.`tipo`, COUNT(t.id) as quantidade
FROM `transacoes` `t`
JOIN `pessoas` `p` ON `p`.`id` = `t`.`pessoa_id`
WHERE DATE(t.data_caixa) >= '2025-11-01'
AND DATE(t.data_caixa) <= '2025-11-30'
AND `p`.`tipo_cliente` = 'Salutem'
AND `t`.`tipo` = 'PAGAR'
GROUP BY `p`.`tipo_cliente`, `t`.`tipo`
---
    public function getTotalPorTipoCliente($dataInicio = null, $dataFim = null, $tipoCliente = null, $tipoTransacao = null)
    {
        $builder = $this->db->table('transacoes t');
        $builder->select('SUM(t.valor) as total, p.tipo_cliente, t.tipo, COUNT(t.id) as quantidade');
        $builder->join('pessoas p', 'p.id = t.pessoa_id');

        if (!empty($dataInicio)) {
            $builder->where('DATE(t.data_caixa) >=', date('Y-m-d', strtotime($dataInicio)));
        }

        if (!empty($dataFim)) {
            $builder->where('DATE(t.data_caixa) <=', date('Y-m-d', strtotime($dataFim)));
        }

        if (!empty($tipoCliente) && $tipoCliente != 'todos') {
            $builder->where('p.tipo_cliente', $tipoCliente);
        }

        if (!empty($tipoTransacao) && $tipoTransacao != 'todos') {
            $builder->where('t.tipo', $tipoTransacao);
        }

        $builder->groupBy('p.tipo_cliente, t.tipo');

        return $builder->get()->getResultArray();

SELECT DISTINCT `tipo_cliente`
FROM `pessoas`
WHERE `tipo_cliente` IS NOT NULL
AND `tipo_cliente` != ''
ORDER BY `tipo_cliente` ASC
---
    public function getTiposCliente()
    {
        $builder = $this->db->table('pessoas');
        $builder->select('tipo_cliente')->distinct();
        $builder->where('tipo_cliente IS NOT NULL');
        $builder->where("tipo_cliente != ''");
        $builder->orderBy('tipo_cliente', 'ASC');

        return $builder->get()->getResultArray();

SELECT DISTINCT `tipo`
FROM `transacoes`
WHERE `tipo` IS NOT NULL
AND `tipo` != ''
ORDER BY `tipo` ASC
---
    public function getTiposTransacao()
    {
        $builder = $this->db->table('transacoes');
        $builder->select('tipo')->distinct();
        $builder->where('tipo IS NOT NULL');
        $builder->where("tipo != ''");
        $builder->orderBy('tipo', 'ASC');

        return $builder->get()->getResultArray();

SELECT SUM(CASE WHEN t.tipo = 'RECEBER' THEN t.valor ELSE 0 END) as total_receber, SUM(CASE WHEN t.tipo = 'PAGAR' THEN t.valor ELSE 0 END) as total_pagar, SUM(CASE WHEN t.tipo = 'RECEBER' THEN t.valor ELSE -t.valor END) as saldo, COUNT(t.id) as quantidade_total
FROM `transacoes` `t`
JOIN `pessoas` `p` ON `p`.`id` = `t`.`pessoa_id`
WHERE DATE(t.data_caixa) >= '2025-11-01'
AND DATE(t.data_caixa) <= '2025-11-30'
AND `p`.`tipo_cliente` = 'Salutem'
AND `t`.`tipo` = 'PAGAR'
---
    public function getResumoGeral($dataInicio = null, $dataFim = null, $tipoCliente = null, $tipoTransacao = null)
    {
        $builder = $this->db->table('transacoes t');
        $builder->select("
            SUM(CASE WHEN t.tipo = 'RECEBER' THEN t.valor ELSE 0 END) as total_receber,
            SUM(CASE WHEN t.tipo = 'PAGAR' THEN t.valor ELSE 0 END) as total_pagar,
            SUM(CASE WHEN t.tipo = 'RECEBER' THEN t.valor ELSE -t.valor END) as saldo,
            COUNT(t.id) as quantidade_total
        ");
        $builder->join('pessoas p', 'p.id = t.pessoa_id');

        if (!empty($dataInicio)) {
            $builder->where('DATE(t.data_caixa) >=', date('Y-m-d', strtotime($dataInicio)));
        }

        if (!empty($dataFim)) {
            $builder->where('DATE(t.data_caixa) <=', date('Y-m-d', strtotime($dataFim)));
        }

        if (!empty($tipoCliente) && $tipoCliente != 'todos') {
            $builder->where('p.tipo_cliente', $tipoCliente);
        }

        if (!empty($tipoTransacao) && $tipoTransacao != 'todos') {
            $builder->where('t.tipo', $tipoTransacao);
        }

        $result = $builder->get()->getRowArray();