app/app/Models/TransacaoModel.php

    public function getSaldoInicial(string $dataInicio): float
    {
        $builder = $this->db->table('transacoes');

        // Limpa a vírgula (,) e espaços antes de somar.
        $selectValue = "CAST(REPLACE(TRIM(valor), ',', '.') AS DECIMAL(10,2))";

        // Consulta única e robusta
        $builder->select(
            "COALESCE(SUM(IF(TRIM(UPPER(tipo)) = 'RECEBER', {$selectValue}, 0)), 0) as entradas, " .
                "COALESCE(SUM(IF(TRIM(UPPER(tipo)) = 'PAGAR', {$selectValue}, 0)), 0) as saidas",
            false
        );

        // FILTROS
        $builder->where('data_caixa <', $dataInicio);
        $builder->where("TRIM(UPPER(status)) = 'CONCLUIDA'", null, false);

        $resultado = $builder->get()->getRow();
---
SELECT COALESCE(SUM(IF(TRIM(UPPER(tipo)) = 'RECEBER', CAST(REPLACE(TRIM(valor), ',', '.') AS DECIMAL(10,2)), 0)), 0) as entradas, COALESCE(SUM(IF(TRIM(UPPER(tipo)) = 'PAGAR', CAST(REPLACE(TRIM(valor), ',', '.') AS DECIMAL(10,2)), 0)), 0) as saidas
FROM `transacoes`
WHERE `data_caixa` < '2025-01-01'
AND TRIM(UPPER(status)) = 'CONCLUIDA'

    public function getFluxoLiquidoPorTipo(string $dataInicio, string $dataFim, string $tipoFluxo): array
    {
        $builder = $this->db->table('transacoes t');

        // Limpa a vírgula (,) e espaços antes de somar.
        $selectValue = "CAST(REPLACE(TRIM(t.valor), ',', '.') AS DECIMAL(10,2))";

        // MUDANÇA CRÍTICA: Usando IF e comparação com operador de igualdade
        $builder->select(
            "COALESCE(SUM(IF(TRIM(UPPER(t.tipo)) = 'RECEBER', {$selectValue}, 0)), 0) as entradas, " .
                "COALESCE(SUM(IF(TRIM(UPPER(t.tipo)) = 'PAGAR', {$selectValue}, 0)), 0) as saidas",
            false
        );

        $builder->join('categorias_financeiras c', 't.categoria_id = c.id');
        // Filtro de Status (CORREÇÃO DE SINTAXE)
        $builder->where("TRIM(UPPER(t.status)) = 'CONCLUIDA'", null, false);
        $builder->where('c.tipo_fluxo', $tipoFluxo);
        $builder->where('t.data_caixa >=', $dataInicio);
        $builder->where('t.data_caixa <=', $dataFim);

        $resultado = $builder->get()->getRow();
---
SELECT COALESCE(SUM(IF(TRIM(UPPER(t.tipo)) = 'RECEBER', CAST(REPLACE(TRIM(t.valor), ',', '.') AS DECIMAL(10,2)), 0)), 0) as entradas, COALESCE(SUM(IF(TRIM(UPPER(t.tipo)) = 'PAGAR', CAST(REPLACE(TRIM(t.valor), ',', '.') AS DECIMAL(10,2)), 0)), 0) as saidas
FROM `transacoes` `t`
JOIN `categorias_financeiras` `c` ON `t`.`categoria_id` = `c`.`id`
WHERE TRIM(UPPER(t.status)) = 'CONCLUIDA'
AND `c`.`tipo_fluxo` = 'FCO'
AND `t`.`data_caixa` >= '2025-01-01'
AND `t`.`data_caixa` <= '2025-12-31'